

# TODO: Переписать "сlustering_vectors" и "encoding_lyrics" на C++
#  Команда для отправки шаблона "pattern.json"
#  Команда для добавления файла в неотсортированное (/DB/Unprocessed) (Проверка, что файл — json)
#  Команда для запуска сортировки и составления таблиц из неотсортированного clear_unprocessed()
#  Команда для запуска пересчёта кластеров ///
#  Команда для поиска полного совпадения
#  Команда вывода количества слов во всей базе данных (вводишь "я" -> ответ 173)
#  Команда вывода количества слов в альбоме или песне (вводишь "я" -> ответ 173)
#
#
# TODO:
#  U — Не отсортированные.
#  С — Кластеры. (Среднии вектора и ссылка на кластер)
#  N — Шумные вектора (Те, которые не выходят за все кластеры)
#
#
# TODO:
#  С-1:
#   Аverage — Средний вектор кластера
#    (...144...)
#   Edge — Краевые вектора + соседи
#    (...) (Индексы)
#   Vectors — Вектора кластера
#       Где встречается слово  Вектор слова
#    ...(...(Ar, Al, S, L)...) (...144...)...
#
#
#
#
#
#
#
#
#
#
#
#
#
#

