from config.bot import *
rt: Router = Router()

# TODO:
#  Команда /start
#  Команда /help
#  Команда /about
#  Команда /artists — показывать список исполнителей, которые есть в базах данных
#  Команда /artist {id/название} — показывать альбомы исполнителя (Со стрелочками)
#  Команда /album {id/название} — показывать песни из альбома (Со стрелочками) (Обложка)
#  Команда /song {id/название} — показывать текст песни если есть (В целом всю информацию о треке, которая есть)
#  Команда /format {текст \n ссылка} — форматировать сообщение под формата ППТПИ (Для Админов ППТПИ нужна кнопка «опубликовать»)
#  Команда /search
#  Текстовая команда «Исполнители»
#  Ловитель пустого колбека
